# Напишите программу, которая получает целое число и возвращает его шестнадцатеричное строковое представление.
# Функцию hex используйте для проверки своего результата.

num_10 = int(input('введите целое число: '))
print(hex(num_10))
num_16 = ''
while num_10 > 0:
    x = num_10 % 16
    num_10 //= 16
    if 0<=x<10:
        num_16 = str(x) + num_16
    elif x == 10:
        num_16 = 'a' + num_16
    elif x == 11:
        num_16 = 'b' + num_16
    elif x == 12:
        num_16 = 'c' + num_16
    elif x == 13:
        num_16 = 'd' + num_16
    elif x == 14:
        num_16 = 'e' + num_16
    elif x == 15:
        num_16 = 'f' + num_16
print('0x' + num_16)